tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        nFaces          300;
        startFace       8300;
    }
    minX
    {
        type            patch;
        nFaces          100;
        startFace       8600;
    }
    maxX
    {
        type            patch;
        nFaces          100;
        startFace       8700;
    }
    minY
    {
        type            wall;
        nFaces          300;
        startFace       8800;
    }
    minZ
    {
        type            wall;
        nFaces          300;
        startFace       9100;
    }
    maxZ
    {
        type            wall;
        nFaces          300;
        startFace       9400;
    }
)

// ************************************************************************* //
